/**
*	created:		2012-6-28   9:09
*	filename: 		SysMessageDef
*	author:			FreeKnight
*	Copyright (C): 	
*	purpose:		系统信息的相关定义
*/
//------------------------------------------------------------------------
#pragma once
//------------------------------------------------------------------------
// 系统信息类型
enum SYS_MESSAGE_TYPE
{
	SMT_FLOAT,					// 浮动提示栏
	SMT_ABOVE,					// 上方提示栏		
	SMT_MIDDLE,					// 中间提示栏
	SMT_UNDER,					// 下方提示栏
	SMT_HELP,					// 帮助提示栏
};
//------------------------------------------------------------------------
// 系统信息结构体
struct SSysMessage
{
	int nType;					// 消息类型
	int nTextLen;				// 文本长度
};
//------------------------------------------------------------------------