/**
*	created:		2012-6-29   21:17
*	filename: 		IMedicament
*	author:			FreeKnight
*	Copyright (C): 	
*	purpose:		药品
*/
//------------------------------------------------------------------------
#pragma once
//------------------------------------------------------------------------
#include "IGoods.h"
//------------------------------------------------------------------------
struct IMedicament : public IGoods
{
	// 取得扩展buf
	virtual BYTE *		GetExtendBuf(int &nLen) = NULL;
};
//------------------------------------------------------------------------