/**
*	created:		2012-7-2   22:21
*	filename: 		IStall
*	author:			FreeKnight
*	Copyright (C): 	
*	purpose:		摊位
*/
//------------------------------------------------------------------------
#pragma once
//------------------------------------------------------------------------
#include "../../FKGame/SceneObj/IMapThing.h"
//------------------------------------------------------------------------
struct IStall : public IMapThing
{
	// 取得摊主
	virtual UID			GetMaster(void) = NULL;
};
//------------------------------------------------------------------------