/**
*	created:		2012-6-28   2:15
*	filename: 		IPaoPao
*	author:			FreeKnight
*	Copyright (C): 	
*	purpose:		生物头上的泡泡的接口
*/
//------------------------------------------------------------------------
#pragma once
//------------------------------------------------------------------------
#include <Windows.h>
#include "../FKCanvas/IFKCanvas.h"
//------------------------------------------------------------------------
// 泡泡的接口
struct IPaoPao
{
	//-------------------------------------------------------------------
	// 描  述：设置泡泡要显示的文本
	// 参  数：[输入] LPCSTR lpszText - 要显示的文本	
	// 返回值：BOOL - 文本可以解析返回TRUE，否则返回FALSE
	//-------------------------------------------------------------------
	virtual BOOL SetText(LPCSTR lpszText) = 0;

	//-------------------------------------------------------------------
	// 描  述：绘制泡泡
	// 参  数：[输入] ICanvas * pCanvas - Canvas指针
	// 参  数：[输入] const POINT & ptBottomCenter - 泡泡底端的中心位置
	// 参  数：[输入] const char * szName - 生物名称
	// 参  数：[输入] const WPixel & clrName - 名称颜色
	// 参  数：[输入] ITTFont * pNameFont - 显示名称使用的字体
	// 返回值：void
	//-------------------------------------------------------------------
	virtual void OnDraw(ICanvas * pCanvas, 
						const POINT & ptBottomCenter, 
						const char * szName, 
						const WPixel & clrName, 
						ITTFont * pNameFont) = 0;

	//-------------------------------------------------------------------
	// 描  述：释放泡泡
	//-------------------------------------------------------------------
	virtual void Release(void) = 0;
};
//------------------------------------------------------------------------
