/**
*	created:		2012-7-3   23:18
*	filename: 		CHorse
*	author:			FreeKnight
*	Copyright (C): 	
*	purpose:		马，非物品，非thing，只是一个数据集合
*/
//------------------------------------------------------------------------
#include "../Include/ThingClientCommon.h"
#include "../Include/CHorse.h"
//------------------------------------------------------------------------
CHorse::CHorse(void)
{
	m_nID = 0;
}
//------------------------------------------------------------------------
CHorse::~CHorse(void)
{

}
//------------------------------------------------------------------------
void CHorse::SetID(int nHorseID)
{
	m_nID = nHorseID;
}
//------------------------------------------------------------------------
int CHorse::GetID(void)
{
	return m_nID;
}
//------------------------------------------------------------------------